Garbage/four_obstacle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0032;

vertices
(
    (0.0 1.5 0.0)        // 0
    (5.0 1.5 0.0)        // 1
    (0.0 2.0 0.0)        // 2
    (5.0 2.0 0.0)        // 3
    (0.0 3.0 0.0)        // 4
    (5.0 3.0 0.0)        // 5
    (8.0 1.5 0.0)        // 6
    (9.0 1.5 0.0)        // 7
    (8.0 2.0 0.0)        // 8
    (9.0 2.0 0.0)        // 9
    (8.0 3.0 0.0)        // 10
    (9.0 3.0 0.0)        // 11
    (12.0 1.5 0.0)        // 12
    (13.0 1.5 0.0)        // 13
    (12.0 2.0 0.0)        // 14
    (13.0 2.0 0.0)        // 15
    (12.0 3.0 0.0)        // 16
    (13.0 3.0 0.0)        // 17
    (16.0 1.5 0.0)        // 18
    (17.0 1.5 0.0)        // 19
    (16.0 2.0 0.0)        // 20
    (17.0 2.0 0.0)        // 21
    (16.0 3.0 0.0)        // 22
    (17.0 3.0 0.0)        // 23
    (20.0 1.5 0.0)        // 24
    (25.0 1.5 0.0)        // 25
    (20.0 2.0 0.0)        // 26
    (25.0 2.0 0.0)        // 27
    (20.0 3.0 0.0)        // 28
    (25.0 3.0 0.0)        // 29
    (0.0 1.5 0.1)        // 30
    (5.0 1.5 0.1)        // 31
    (0.0 2.0 0.1)        // 32
    (5.0 2.0 0.1)        // 33
    (0.0 3.0 0.1)        // 34
    (5.0 3.0 0.1)        // 35
    (8.0 1.5 0.1)        // 36
    (9.0 1.5 0.1)        // 37
    (8.0 2.0 0.1)        // 38
    (9.0 2.0 0.1)        // 39
    (8.0 3.0 0.1)        // 40
    (9.0 3.0 0.1)        // 41
    (12.0 1.5 0.1)        // 42
    (13.0 1.5 0.1)        // 43
    (12.0 2.0 0.1)        // 44
    (13.0 2.0 0.1)        // 45
    (12.0 3.0 0.1)        // 46
    (13.0 3.0 0.1)        // 47
    (16.0 1.5 0.1)        // 48
    (17.0 1.5 0.1)        // 49
    (16.0 2.0 0.1)        // 50
    (17.0 2.0 0.1)        // 51
    (16.0 3.0 0.1)        // 52
    (17.0 3.0 0.1)        // 53
    (20.0 1.5 0.1)        // 54
    (25.0 1.5 0.1)        // 55
    (20.0 2.0 0.1)        // 56
    (25.0 2.0 0.1)        // 57
    (20.0 3.0 0.1)        // 58
    (25.0 3.0 0.1)        // 59
);

blocks
(
    hex (0 1 3 2 30 31 33 32) (30 22 1) simpleGrading (1 0.1 1)     // Block 0 (middle inlet)
    hex (2 3 5 4 32 33 35 34) (30 22 1) simpleGrading (1 0.1 1)    // Block 1 (upper inlet, non-slip top)
    hex (1 6 8 3 31 36 38 33) (30 22 1) simpleGrading (1 0.1 1)    // Block 2 (connecting inlet to first obstacle)
    hex (6 7 9 8 36 37 39 38) (30 22 1) simpleGrading (1 0.1 1)    // Block 3 (middle first obstacle)
    hex (8 9 11 10 38 39 41 40) (30 22 1) simpleGrading (1 0.1 1)  // Block 4 (upper first obstacle)
    hex (7 12 14 9 37 42 44 39) (30 22 1) simpleGrading (1 0.1 1)  // Block 5 (connecting first to second obstacle)
    hex (12 13 15 14 42 43 45 44) (30 22 1) simpleGrading (1 0.1 1) // Block 6 (middle second obstacle)
    hex (14 15 17 16 44 45 47 46) (30 22 1) simpleGrading (1 0.1 1) // Block 7 (upper second obstacle)
    hex (13 18 20 15 43 48 50 45) (30 22 1) simpleGrading (1 0.1 1) // Block 8 (connecting second to third obstacle)
    hex (18 19 21 20 48 49 51 50) (30 22 1) simpleGrading (1 0.1 1) // Block 9 (middle third obstacle)
    hex (20 21 23 22 50 51 53 52) (30 22 1) simpleGrading (1 0.1 1) // Block 10 (upper third obstacle)
    hex (19 24 26 21 49 54 56 51) (30 22 1) simpleGrading (1 0.1 1) // Block 11 (connecting third obstacle to outlet)
    hex (24 25 27 26 54 55 57 56) (30 22 1) simpleGrading (1 0.1 1)  // Block 12 (middle outlet)
    hex (26 27 29 28 56 57 59 58) (30 22 1) simpleGrading (1 0.1 1) // Block 13 (upper outlet, non-slip top)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 30 32 2)    // Middle inlet
            (2 32 34 4)    // Upper inlet
        );
    }

    symmetry
    {
        type symmetryPlane;
        faces
        (
            (0 1 31 30)      // Inlet section
            (1 6 36 31)      // First connection
            (6 7 37 36)      // First obstacle
            (7 12 42 37)     // Second connection
            (12 13 43 42)    // Second obstacle
            (13 18 48 43)    // Third connection
            (18 19 49 48)    // Third obstacle
            (19 24 54 49)    // Fourth connection
            (24 25 55 54)    // Outlet section
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            // Upper wall faces
            (4 34 35 5)      // Inlet section top
            (5 35 33 3)      // Inlet section right
            (3 33 38 8)      // First connection top
            (8 38 40 10)     // First obstacle left
            (10 40 41 11)    // First obstacle top
            (9 11 41 39)     // First obstacle right
            (9 39 44 14)     // Second connection top
            (14 44 46 16)    // Second obstacle left
            (16 46 47 17)    // Second obstacle top
            (15 17 47 45)    // Second obstacle right
            (15 45 50 20)    // Third connection top
            (20 50 52 22)    // Third obstacle left
            (22 52 53 23)    // Third obstacle top
            (21 23 53 51)    // Third obstacle right
            (21 51 56 26)    // Fourth connection top
            (26 56 58 28)    // Outlet section left
            (28 58 59 29)    // Outlet section top
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (25 27 57 55)    // Middle outlet
            (27 29 59 57)    // Upper outlet
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            // Front faces (z = 0)
            (0 1 3 2)        // Inlet section
            (2 3 5 4)        // Inlet section
            (1 6 8 3)        // First connection
            (6 7 9 8)        // First obstacle
            (8 9 11 10)      // First obstacle
            (7 12 14 9)      // Second connection
            (12 13 15 14)    // Second obstacle
            (14 15 17 16)    // Second obstacle
            (13 18 20 15)    // Third connection
            (18 19 21 20)    // Third obstacle
            (20 21 23 22)    // Third obstacle
            (19 24 26 21)    // Fourth connection
            (24 25 27 26)    // Outlet section
            (26 27 29 28)    // Outlet section

            // Back faces (z = 0.1)
            (30 31 33 32)    // Inlet section
            (32 33 35 34)    // Inlet section
            (31 36 38 33)    // First connection
            (36 37 39 38)    // First obstacle
            (38 39 41 40)    // First obstacle
            (37 42 44 39)    // Second connection
            (42 43 45 44)    // Second obstacle
            (44 45 47 46)    // Second obstacle
            (43 48 50 45)    // Third connection
            (48 49 51 50)    // Third obstacle
            (50 51 53 52)    // Third obstacle
            (49 54 56 51)    // Fourth connection
            (54 55 57 56)    // Outlet section
            (56 57 59 58)    // Outlet section
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //