Garbage/four_obstacle/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;
setFormat     raw;

sets
(
    fig7_x_037
    {
        type        uniform;
        axis        y;
        start       (7 1.5 0.05);
        end         (7 3 0.05);
        nPoints     100;
    }

    fig7_x_05
    {
        type        uniform;
        axis        y;
        start       (6 1.5 0.05);
        end         (6 3 0.05);
        nPoints     100;
    }

    fig7_x_1
    {
        type        uniform;
        axis        y;
        start       (5.5 1.5 0.05);
        end         (5.5 3 0.05);
        nPoints     100;
    }

    fig7_x_2
    {
        type        uniform;
        axis        y;
        start       (12 1.5 0.05);
        end         (12 3 0.05);
        nPoints     100;
    }

    fig10_x_05
    {
        type        uniform;
        axis        y;
        start       (13.5 1.5 0.05);
        end         (13.5 3 0.05);
        nPoints     100;
    }

    fig10_x_1
    {
        type        uniform;
        axis        y;
        start       (15 1.5 0.05);
        end         (15 3 0.05);
        nPoints     100;
    }

    fig11_y_0
    {
        type        uniform;
        axis        x;
        start       (5.5 1.5 0.05);
        end         (15 1.5 0.05);
        nPoints     100;
    }

    fig11_y_04
    {
        type        uniform;
        axis        x;
        start       (5.5 2.0 0.05);
        end         (15 2.0 0.05);
        nPoints     100;
    }

    fig11_y_1
    {
        type        uniform;
        axis        x;
        start       (5.5 3 0.05);
        end         (15 3 0.05);
        nPoints     100;
    }
);

surfaceFormat null;

surfaces ();

fields
(
    N1
    N2
    tau
    U
    p
);

// ************************************************************************* //